IRP/src/DataProcessors/MobileInvent/MobileInvent.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
 <name>MobileInvent</name>
</mdclass:DataProcessor>

IRP/src/Documents/PhysicalCountByLocation/PhysicalCountByLocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>PhysicalCountByLocation</name>
 <posting>Deny</posting>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <attributes>
  <name>PhysicalInventory</name>
  <type>
   <types>DocumentRef.PhysicalInventory</types>
  </type>
 </attributes>
 <attributes>
  <name>ResponsibleUser</name>
  <type>
   <types>CatalogRef.Users</types>
  </type>
 </attributes>
 <attributes>
  <name>RuleEditQuantity</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Status</name>
  <type>
   <types>CatalogRef.ObjectStatuses</types>
  </type>
 </attributes>
 <attributes>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>UseSerialLot</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.PhysicalCountByLocationTransactionType</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>ExpCount</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>PhysCount</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>ManualFixedCount</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Difference</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>UseSerialLotNumber</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Barcode</name>
   <type>
    <types>DefinedType.typeBarcode</types>
   </type>
  </attributes>
  <attributes>
   <name>Date</name>
   <type>
    <types>Date</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Catalogs/ObjectStatuses/ObjectStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ObjectStatuses</name>
 <hierarchical>true</hierarchical>
 <predefined>
  <items>
   <name>SalesOrder</name>
  </items>
  <items>
   <name>SalesReturnOrder</name>
  </items>
  <items>
   <name>PurchaseOrder</name>
  </items>
  <items>
   <name>PurchaseReturnOrder</name>
  </items>
  <items>
   <name>InventoryTransferOrder</name>
  </items>
  <items>
   <name>OutgoingPaymentOrder</name>
  </items>
  <items>
   <name>ReconciliationStatement</name>
  </items>
  <items>
   <name>PhysicalCountByLocation</name>
  </items>
  <items>
   <name>PhysicalInventory</name>
  </items>
  <items>
   <name>IncomingPaymentOrder</name>
  </items>
  <items>
   <name>ChequeBondTransaction</name>
  </items>
  <items>
   <name>WorkOrder</name>
  </items>
  <items>
   <name>ProductionPlanningCorrection</name>
  </items>
 </predefined>
 <attributes>
  <name>SetByDefault</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Posting</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingChequeBondBalance</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingVendorTransactions</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingCustomerTransactions</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PostingCashPlanning</name>
  <type>
   <types>EnumRef.DocumentPostingTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>NextPossibleStatuses</name>
  <attributes>
   <name>Status</name>
   <type>
    <types>CatalogRef.ObjectStatuses</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Users</name>
  <attributes>
   <name>User</name>
   <type>
    <types>CatalogRef.Users</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/DataProcessors/MobileInvent/Forms/Form/Module.bsl
#Region Barcode
&AtClient
Procedure SearchByBarcode(Command, Barcode = "")
	Settings = BarcodeClient.GetBarcodeSettings();
	//@skip-warning
	Settings.MobileBarcodeModule = ThisObject;
	DocumentsClient.SearchByBarcode(Barcode, Object, ThisObject, ThisObject, , Settings);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "NewBarcode" And IsInputAvailable() Then
		SearchByBarcode(Undefined, Parameter);
	EndIf;
EndProcedure

&AtClient
Procedure InputBarcode(Command)
	Barcode = 0;
	ShowInputNumber(New NotifyDescription("AddBarcodeAfterEnd", ThisForm), Barcode, R().SuggestionToUser_2);
EndProcedure

&AtClient
Procedure AddBarcodeAfterEnd(Number, AdditionalParameters) Export
	If Not ValueIsFilled(Number) Then
		Return;
	EndIf;
	Barcode = Format(Number, "NG=");
	If Object.Ref.IsEmpty() Then
		DocumentIsSet = False;
		Message = FindAndSetDocument(Barcode, DocumentIsSet);
		If Not DocumentIsSet Then
			CommonFunctionsClientServer.ShowUsersMessage(Message);
		EndIf;
		Return;
	EndIf;
	SearchByBarcode(Undefined, Barcode);
EndProcedure

&AtClient
Procedure SearchByBarcodeEnd(Result, AdditionalParameters) Export

	If Object.Ref.IsEmpty() Then
		CommonFunctionsClientServer.ShowUsersMessage(R().InfoMessage_025, "DocumentRef");
	EndIf;
	
	For Each Row In Result.FoundedItems Do
		
		If Row.isService Then
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().InfoMessage_026, Row.Item));
			BarcodeClient.CloseMobileScanner();	
			Return;
		EndIf;
		
		NewRow = Object.ItemList.Add();
		NewRow.Key = New UUID;
		FillPropertyValues(NewRow, Row);
		NewRow.PhysCount = Row.Quantity;
		NewRow.Barcode = Result.Barcodes[0];
		NewRow.Date = CurrentDate();
		
		If Row.UseSerialLotNumber And NewRow.SerialLotNumber.IsEmpty() Then
			BarcodeClient.CloseMobileScanner();		
			StartEditQuantity(NewRow.GetID(), True);	
		EndIf;
	EndDo;
	
	If Result.FoundedItems.Count() Then
		If RuleEditQuantity Then
			BarcodeClient.CloseMobileScanner();
			StartEditQuantity(NewRow.GetID(), True);
		EndIf;
		Write();
	EndIf;

EndProcedure

// Scan barcode end mobile.
// 
// Parameters:
//  Barcode - String - Barcode
//  Result - Boolean - Result
//  Message - String - Message
//  Parameters - See BarcodeClient.GetBarcodeSettings
&AtClient
Procedure ScanBarcodeEndMobile(Barcode, Result, Message, Parameters) Export
	
	Message = "";
	
	If Object.Ref.IsEmpty() Then
		Message = FindAndSetDocument(Barcode, Result);

		If Result Then
			BarcodeClient.CloseMobileScanner();
		EndIf;
	Else
		ProcessBarcodeResult = Barcodeclient.ProcessBarcode(Barcode, Parameters);
		If ProcessBarcodeResult Then
			If Parameters.Result.FoundedItems[0].isService And Parameters.Filter.DisableIfIsService Then
				Message = StrTemplate(R().InfoMessage_026, Parameters.Result.FoundedItems[0].Item);
				Result = False;
			Else
				Message = R().S_018;
			EndIf;
		Else
			Result = False;
			Message = StrTemplate(R().S_019, Barcode);
		EndIf;
	EndIf;
EndProcedure

#EndRegion

&AtClient
Procedure OpenRow(Command)
	RowSelected = Items.ItemList.CurrentRow;
	StartEditQuantity(RowSelected);
EndProcedure

&AtClient
Procedure ItemListSelection(Item, RowSelected, Field, StandardProcessing)
	StandardProcessing = False;
	StartEditQuantity(RowSelected);
EndProcedure

&AtClient
Procedure StartEditQuantity(Val RowSelected, AutoMode = False)
	
	If RowSelected = Undefined Then
		Return;
	EndIf;
	
	Structure = New Structure();
	ItemListRow = Object.ItemList.FindByID(RowSelected);
	Structure.Insert("ItemRef", Undefined);
	Structure.Insert("ItemKey", ItemListRow.ItemKey);
	Structure.Insert("SerialLotNumber", ItemListRow.SerialLotNumber);
	Structure.Insert("Quantity", ItemListRow.PhysCount);
	Structure.Insert("RowID", RowSelected);
	Structure.Insert("AutoMode", AutoMode);
	NotifyOnClosing = New NotifyDescription("OnEditQuantityEnd", ThisObject);
	OpenForm("DataProcessor.MobileInvent.Form.RowForm", Structure, ThisObject, , , , NotifyOnClosing);
EndProcedure

&AtClient
Procedure OnEditQuantityEnd(Result, AddInfo) Export
	If Result = Undefined Then
		Return;
	EndIf;
	ItemListRow = Object.ItemList.FindByID(Result.RowID);
	ItemListRow.SerialLotNumber = Result.SerialLotNumber;
	ItemListRow.PhysCount = Result.Quantity;
	Write();
EndProcedure

&AtClient
Procedure CompleteLocation()
	NotifyDescription = New NotifyDescription("InputQuantityEnd", ThisObject);
	If Not SecondTryToInputQuantity Then
		Write();
		Text = R().QuestionToUser_018;
	Else
		Text = R().InfoMessage_009;
	EndIf;
	ShowInputNumber(NotifyDescription, "", Text);
EndProcedure

&AtClient
Procedure InputQuantityEnd(Quantity, Parameters) Export
	If Quantity <> Object.ItemList.Total("PhysCount") Then
		If Not SecondTryToInputQuantity Then
			SecondTryToInputQuantity = True;
			CompleteLocation();
		Else
			CommonFunctionsClientServer.ShowUsersMessage(R().InfoMessage_010);
			Object.ItemList.Clear();
			Write();
		EndIf;
	Else
		SecondTryToInputQuantity = False;
		CommonFunctionsClientServer.ShowUsersMessage(R().InfoMessage_011);
		SaveAndUpdateDocument();
	EndIf;
EndProcedure

&AtServer
Procedure SaveAndUpdateDocument()
	Object.Status = Catalogs.ObjectStatuses.Complete;
	Write();
	FillDocumentObject(Documents.PhysicalCountByLocation.EmptyRef());
EndProcedure

&AtServer
Function FindAndSetDocument(Number, Result, AddInfo = Undefined)

	Query = New Query();
	Query.Text =
	"SELECT
	|	PhysicalCountByLocation.Ref
	|FROM
	|	Document.PhysicalCountByLocation AS PhysicalCountByLocation
	|WHERE
	|	PhysicalCountByLocation.Number = &Number";

	Query.SetParameter("Number", Number(Number));

	QueryResult = Query.Execute();

	SelectionDetailRecords = QueryResult.Select();

	If SelectionDetailRecords.Next() Then
		FillDocumentObject(SelectionDetailRecords.Ref);
		Result = True;
		Return SelectionDetailRecords.Ref;
	Else
		Result = False;
		Return StrTemplate(R().Error_083, Number);
	EndIf;

EndFunction

&AtClient
Procedure DocumentRefOnChange(Item)
	FillDocumentObject(DocumentRef);
EndProcedure

&AtServer
Procedure FillDocumentObject(DocRef)
	DocumentRef = DocRef;
	If DocumentRef.IsEmpty() Then
		ValueToFormAttribute(Documents.PhysicalCountByLocation.CreateDocument(), "Object");
		LockFormDataForEdit();
	Else

		If DocRef.Status = Catalogs.ObjectStatuses.Complete Then
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().InfoMessage_014, DocRef.Number));
			FillDocumentObject(Documents.PhysicalCountByLocation.EmptyRef());
			Return;
		ElsIf Not DocRef.ResponsibleUser.isEmpty() And Not DocRef.ResponsibleUser = SessionParameters.CurrentUser Then
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().InfoMessage_012, DocRef.Number,
				DocRef.ResponsibleUser));
			FillDocumentObject(Documents.PhysicalCountByLocation.EmptyRef());
			Return;
		EndIf;

		DocObj = DocRef.GetObject();

		ValueToFormAttribute(DocObj, "Object");

		Object.ResponsibleUser = SessionParameters.CurrentUser;
		Write();
		Items.ItemListSerialLotNumber.Visible = DocRef.PhysicalInventory.UseSerialLot;
		CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().InfoMessage_013, DocObj.Number));
	EndIf;

	RuleEditQuantity = Object.RuleEditQuantity;
EndProcedure
